app/Http/Controllers/BooksController.php

    public function index($id)
    {
        $books = Book::where([['is_active',1],['rack_id',$id]])->get();
---
select * from `books` where (`is_active` = '1' and `rack_id` = '2')