app/Http/Controllers/RacksController.php

    public function index()
    {
        $racks1 = \DB::table('racks')
            ->leftJoin('books', 'books.rack_id', '=', 'racks.id')
            ->select(\DB::raw('racks.id,racks.name, count(books.id) as books'))
            ->groupBy('racks.id')
            ->groupBy('racks.name');

        $racks = \DB::table('racks')
            ->rightJoin('books', 'books.rack_id', '=', 'racks.id')
            ->select(\DB::raw('racks.id,racks.name, count(books.id) as books'))
            ->where('racks.is_active',1)
            ->where('books.is_active',1)
            ->groupBy('racks.id')
            ->groupBy('racks.name')
            ->union($racks1)
            ->get();
---
(select racks.id,racks.name, count(books.id) as books from `racks` inner join `books` on `books`.`rack_id` = `racks`.`id` where `racks`.`is_active` = '1' and `books`.`is_active` = '1' group by `racks`.`id`, `racks`.`name`) union (select racks.id,racks.name, count(books.id) as books from `racks` inner join `books` on `books`.`rack_id` = `racks`.`id` group by `racks`.`id`, `racks`.`name`)