app/Http/Controllers/Admin/BooksController.php

select * from `books` order by `id` desc
select * from `racks` order by `name` asc
---
    public function index()
    {
        $books = App\Book::orderBy('id','Desc')->get();
        $racks = App\Rack::orderBy('name','Asc')->get();

select * from `books` where `books`.`id` = '16' limit 1
---
    public function getbook(Request $request)
    {
        $book = Book::find($request->id);

select count(*) as aggregate from `books` where `rack_id` = '2'
insert into `books` (`title`, `rack_id`, `pub_year`, `author`, `is_active`, `created_by`, `created_at`, `updated_by`, `updated_at`) values ('Book10', '2', '1994', 'Author5', '1', '3', '2017-10-12 22:46:05', '3', '2017-10-12 22:46:05')
---
    public function save(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'title' => 'required',
            'rack_id' => 'required',
        ]);
        $maxRBooks = Book::where('rack_id',$request->input('rack_id'))->count();
        if($maxRBooks >= 10)
        {
            $validator->getMessageBag()->add('maxrbooks', 'You can not not add more than 10 books in a rack.');
            return response()->json($validator->errors()->all());
        }

        $dt = date('Y-m-d H:i:s', strtotime($request->d . ' ' . $request->time));
        $book = new Book;

        $book->title = $request->input('title');
        $book->rack_id = $request->input('rack_id');
        $book->pub_year = $request->input('pub_year');
        $book->author = $request->input('author');
        $book->is_active = $request->input('status');
        $book->created_by = Auth::guard('admins')->user()->id;
        $book->created_at = $dt;
        $book->updated_by = Auth::guard('admins')->user()->id;
        $book->updated_at = $dt;
        $book->save();

select * from `books` where `books`.`id` = '17' limit 1
update `books` set `title` = 'Book4', `pub_year` = '1995', `updated_at` = '2017-10-12 20:55:54' where `id` = '16'
---
    public function update(Request $request, $id)
    {
        $dt = date('Y-m-d H:i:s', strtotime($request->d . ' ' . $request->time));

        $book = Book::find($id);

        $book->title = $request->input('title');
        $book->rack_id = $request->input('rack_id');
        $book->author = $request->input('author');
        $book->pub_year = $request->input('pub_year');
        $book->is_active = $request->input('status');
        $book->updated_by = Auth::guard('admins')->user()->id;
        $book->updated_at = $dt;

select * from `books` where `books`.`id` = '12' limit 1
delete from `books` where `id` = '12'
---
    public function delete($id)
    {
        $book = new Book();
        $book = Book::find($id);
        $book->delete();