app/Http/Controllers/Admin/RacksController.php

    public function index()
    {
        $racks = App\Rack::orderBy('id','Desc')->get();
---
select * from `racks` order by `id` desc

	public function save(Request $request)
	{
        $validator = Validator::make($request->all(), [
            'name' => 'required|unique:racks',
        ]);
        if ($validator->fails()) {
            return response()->json($validator->errors()->all());
        }

        $dt = date('Y-m-d H:i:s', strtotime($request->d . ' ' . $request->time));
		$rack = new Rack;

		$rack->name = $request->input('name');
        $rack->is_active = $request->input('status');
        $rack->created_by = Auth::guard('admins')->user()->id;
        $rack->created_at = $dt;
        $rack->updated_by = Auth::guard('admins')->user()->id;
        $rack->updated_at = $dt;
        $rack->save();
---
insert into `racks` (`name`, `is_active`, `is_deleted`, `created_by`, `created_at`, `updated_by`, `updated_at`) values ('Rack3', '1', '0', '3', '2017-10-12 20:56:40', '3', '2017-10-12 20:56:40')

    public function update(Request $request, $id)
	{
        $dt = date('Y-m-d H:i:s', strtotime($request->d . ' ' . $request->time));

        $rack = Rack::find($id);

        $rack->name = $request->input('name');
        $rack->is_active = $request->input('status');
        $rack->updated_by = Auth::guard('admins')->user()->id;
        $rack->updated_at = $dt;
---
select * from `racks` where `racks`.`id` = '4' limit 1
update `racks` set `is_active` = '0', `updated_at` = '2017-10-12 20:57:18' where `id` = '4'